app/controllers/admins_controller.rb

SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = NULL) ORDER BY updated_at DESC LIMIT 1
---
  def register
    if request.post?
       node = AccessNode.find_by_mac(params[:gw_mac])